Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Similarly, HKEY_CLASSES_ROOT provides a combined view of keys from
ja: 同様に、HKEY_CLASSES_ROOTは、以下のキーを組み合わせたビューを提供します。

source: Similarly, a line that ends with an expression operator is automatically merged with the line below it.
ja: 同様に、式演算子で終わる行は、自動的にその下の行にマージされる。

source: Similarly, a reference stored in a property or array element is released when that property or array element is assigned some other value or removed from the object.
ja: 同様に、プロパティや配列要素に格納された参照は、そのプロパティや配列要素に他の値が割り当てられたり、オブジェクトから削除されたりすると解放される。

source: Similarly, a statement may exist to the right of a brace (except the open-brace of the One True Brace style).
ja: 同様に、ブレース（One True Braceスタイルのオープンブレースを除く）の右側にも文が存在する場合があります。

source: Similarly, a variable can be increased or decreased by 1 by using Var++, Var--, ++Var, or --Var.
ja: 同様に、Var++、Var--、++Var、--Varを使えば、変数を1つ増やしたり減らしたりできる。

source: Similarly, any key name enclosed in braces is pressed and released by default.
ja: 同様に、中括弧で囲まれたキー名は、デフォルトで押したり離したりされます。

source: Similarly, arithmetic operations on integers wrap around upon overflow (e.g. 0x7FFFFFFFFFFFFFFF + 1 = -0x8000000000000000).
ja: 同様に、整数の算術演算はオーバーフロー時に折り返される（例：0x7FFFFFFFFFFFF + 1 = -0x800000000000000000）。

source: Similarly, if NewText is empty/blank, the current item/tab will be deselected.
ja: 同様に、NewTextが空/空白の場合は、現在のアイテム/タブが非選択になります。

source: Similarly, if Y1 is greater than Y2, the search will be conducted from bottom to top.
ja: 同様に、Y1が Y2より大きい場合は、下から上に向かって検索を行うことになります。

source: Similarly, if the script replaces one of a ListView's old ImageLists with a new one, it should explicitly destroy the old one.
ja: 同様に、スクリプトがListViewの古いImageListの1つを新しいものに置き換える場合、古いものを明示的に破棄する必要があります。

source: Similarly, if there is no path present, OutDir will be made blank; and if there is a path but no file name present, OutFileName and OutNameNoExt will be made blank.
ja: 同様に、パスが存在しない場合、OutDirは空白になり、パスが存在するがファイル名が存在しない場合、OutFileNameと OutNameNoExtは空白になる。

source: Similarly, it is unable to change a key's state as seen by GetKeyState unless the keystrokes are sent to one of the script's own windows.
ja: 同様に、キーストロークがスクリプト自身のウィンドウに送信されない限り、GetKeyStateによって見られるキーの状態を変更することはできません。

source: Similarly, it may send ← five times via {left 5}.
ja: 同様に、{left 5}を介して←を5回送信することもできます。

source: Similarly, mouse hotkeys cannot be triggered by built-in functions such as Click because all mouse hotkeys use the mouse hook.
ja: 同様に、すべてのマウスホットキーはマウスフックを使用するため、マウスホットキーはClickなどの組み込み機能でトリガーすることはできません。

source: Similarly, specifying X+10 would position the control 10 pixels to the right of the previous control's right edge.
ja: 同様に、X+10を指定すると、コントロールは前のコントロールの右端から10ピクセル右に位置します。

source: Similarly, specifying x+10 would position the control 10 pixels to the right of the previous control's right edge.
ja: 同様に、X+10を指定すると、コントロールは前のコントロールの右端から10ピクセル右に位置します。

source: Similarly, the "Prompt to Create" option has no effect when the "S" option is present.
ja: 同様に、"S"オプションがある場合、"Prompt to Create"オプションは効果を発揮しません。

source: Similarly, the "Prompt to Create" option has no effect when the S option is present.
ja: 同様に、Sオプションがある場合、「作成を促す」オプションは効果を発揮しません。

source: Similarly, the #HotIf directive cannot affect control flow; it merely sets the criteria for any hotkeys and hotstrings specified in the code.
ja: 同様に、#HotIf指示文は、制御フローに影響を与えることはできません。

source: Similarly, the Hotkey function can disable or modify a remapping.
ja: 同様に、ホットキー機能はリマッピングを無効にしたり変更したりすることができる。

source: Similarly, the IsType functions in v2.0 only identify non-ASCII characters as alphabetic if the second parameter is "Locale".
ja: 同様に、v2.0のIsType関数は、第2パラメータが"Locale"の場合にのみ非ASCII文字をアルファベットとして識別します。

source: Similarly, the current thread is unaffected except if it is uninterruptible at the time the LineCount parameter is changed, in which case the new LineCount will be in effect for it.
ja: 同様に、現在のスレッドは、LineCountパラメータが変更された時点で中断不可能な場合を除き、影響を受けない。その場合、新しいLineCountが有効になります。

source: Similarly, the PID of a window can be determined with WinGetPID.
ja: 同様に、WinGetPIDでウィンドウのPIDを知ることができます。

source: Similarly, the X2 and Y2 coordinates will be treated as offsets from the X1 and Y1 coordinates.
ja: 同様に、X2、Y2座標は、X1、Y1座標からのオフセットとして扱われます。

source: Similarly, the expression if not ItemCount would yield the opposite result.
ja: 同様に、if not ItemCount式は逆に真になります。

source: Similarly, the following lines would get merged into a single line because the last two start with "and" or "or":
ja: 同様に、次の2行は「and」または「or」で始まるので、1行にまとめられる：

source: Similarly, the following list contains only a single item with a literal comma inside it:
ja: 同様に、次のリストには、その中にリテラルなカンマを持つ項目が1つだけ含まれています：

source: Similarly, the following list contains only a single item with a literal comma inside it: single,,item.
ja: 同様に、次のリストには、その中にリテラルなカンマを持つ項目が1つだけ含まれています：single,,item。

source: Similarly, the middle button and the turning of the mouse wheel should be assignable normally except on mice whose drivers directly control those buttons.
ja: 同様に、中ボタンとマウスホイールの回転は、ドライバがこれらのボタンを直接制御するマウスを除いて、普通に割り当てることができるはずです。

source: Similarly, the pattern gr(a|e)y does the same thing with the help of the parentheses described below.
ja: 同様に、パターンgr(a|e)yは、以下に説明する括弧の助けを借りて同じことを行う。

source: Similarly, the prefix "r" or "r_" could be used for ByRef parameters, and "s" or "s_" could be used for static variables.
ja: 同様に、ByRefパラメータには接頭辞「r」または「r_」を、静的変数には「s」または「s_」を使用することができる。

source: Similarly, to disable both Win, use this:
ja: 同様に、両方のWinを無効にするには、次のようにします：

source: Similarly, to make the classic Start Menu transparent, see example #2.
ja: 同様に、古典的なスタートメニューを透明にするには、例2を参照してください。

source: Similarly, using ByRef to send a long string back to the caller usually performs better than something like Return HugeString.
ja: 同様に、ByRefを使用して長い文字列を呼び出し元に送り返すと、通常、Return HugeStringのようなものよりも性能が良くなります。

source: Similarly, when the script is finished with x (or is about to overwrite x's value), it should call ObjRelease.
ja: 同様に、スクリプトがxの処理を終えたら（あるいはxの値を上書きしようとしたら）、ObjReleaseを呼び出すべきである。

source: Simple auto-complete:
ja: シンプルなオートコンプリート：

source: Simple auto-complete: any day of the week.
ja: シンプルなオートコンプリート：曜日を問わず。

source: Simple command-line client.
ja: シンプルなコマンドラインクライアントです。

source: Simple expressions can be pieced together to form increasingly more complex expressions.
ja: 簡単な式をつなぎ合わせて、どんどん複雑な式にすることができます。

source: Simple expressions such as this should look fairly familiar.
ja: このようなシンプルな式は、かなり見慣れたものになるはずです。

source: Simple usage.
ja: シンプルな使い方です。

source: Simple word-delete shortcuts for all Edit controls.
ja: すべてのEditコントロールに、シンプルな単語削除ショートカットを搭載。

source: Simple!
ja: シンプルだ！

source: Simple, right?
ja: シンプルでしょう？

source: Simply append bracket notation to the variable which contains the object (array, map or whatever).
ja: オブジェクト（配列、マップ、その他何でも）を含む変数にブラケット表記を追加するだけだ。

source: Simply replace the function name "Send" with one of the following:
ja: 関数名 "Send"を以下のいずれかに置き換えるだけでよい：

source: Simply replace the function name "Send" with one of the following: SendText, SendInput, SendPlay, SendEvent.
ja: 関数名「Send」を以下のいずれかに置き換えるだけでよい：SendText、SendInput、SendPlay、SendEvent。

source: Simply run the script and start typing today, press Tab to complete or press Esc to exit.
ja: スクリプトを実行し、今日の入力を開始し、Tabキーを押して完了するか、Escキーを押して終了するだけでよいです。

source: Simply specify a window title for WinTitle.
ja: WinTitleにウィンドウのタイトルを指定するだけです。

source: Simply specify an opening parenthesis on a new line, then your content, finally a closing parenthesis on its own line.
ja: 新しい行で開始括弧を指定し、次に内容を指定し、最後にその行で終了括弧を指定するだけだ。

source: Simply type in your text and done.
ja: テキストを入力するだけで完了。

source: Simulated mouse dragging might have no effect in RichEdit controls (and possibly others) such as those of WordPad and Metapad.
ja: WordPadやMetapadのようなRichEditコントロールでは、マウスドラッグのシミュレーションが効かない場合があります（他のコントロールの場合もあります）。

source: Simulated mouse wheel rotation produces movement in only one direction (usually downward, but upward in some applications).
ja: マウスのホイールを回転させると、1つの方向（通常は下向きだが、アプリケーションによっては上向き）のみが動くようにシミュレートされる。

source: Simulates the turning of the mouse wheel.
ja: マウスホイールの回転をシミュレートします。

source: Since ** is of higher precedence than unary minus, -2**2 is evaluated like -(2**2) and so yields -4.
ja: **は単項マイナスより優先順位が高いので、-2**2は-(2**2)のように評価され、-4となる。

source: Since Edit and MonthCal controls have their own context menu, a right-click in one of them will not launch the ContextMenu event.
ja: Editと MonthCalコントロールはそれぞれ独自のコンテキストメニューを持っているため、そのうちの1つを右クリックしてもContextMenuイベントは起動しません。

source: Since Objects are dynamic and prototype-based, each class consists of two parts:
ja: オブジェクトは 動的でプロトタイプベースなので、各クラスは2つの部分で構成される：

source: Since return can send back only one value to a function's caller, VarRefs can be used to send back extra results.
ja: returnは関数の呼び出し側に1つの値しか返せないので、VarRefは余分な結果を返すために使用することができます。

source: Since "A" matches whichever window is active at any given moment, WinWaitClose "A" typically waits indefinitely.
ja: "A"はその時点でアクティブなウィンドウにマッチするので、WinWaitClose "A"は通常無期限に待つ。

source: Since "A" matches whichever window is active at any given moment, WinWaitNotActive "A" typically waits indefinitely.
ja: "A"はその時点でアクティブなウィンドウにマッチするので、WinWaitNotActive "A"は通常無期限に待ちます。

source: Since DeleteFile itself doesn't really exist, DllCall automatically tries DeleteFileW:
ja: DeleteFile自体は実際には存在しないので、DllCallは自動的にDeleteFileWを試行します：

source: Since Callback can be an object, it can be a BoundFunc object which inserts additional parameters at the beginning of the parameter list and then calls another function.
ja: Callbackはオブジェクトにできるので、パラメータリストの先頭に追加のパラメータを挿入して、別の関数を呼び出すBoundFuncオブジェクトにすることができます。

source: Since FilePattern may contain wildcards, DirExist may be unsuitable for validating a folder path which is to be used with another function or program.
ja: FilePatternはワイルドカードを含むことができるので、DirExistは他の関数やプログラムで使用するフォルダパスの検証には適さないかもしれません。

source: Since FilePattern may contain wildcards, FileExist may be unsuitable for validating a file path which is to be used with another function or program.
ja: FilePatternはワイルドカードを含むことができるので、FileExistは他の関数やプログラムで使用するファイルパスの検証には適さないかもしれません。

source: Since Value1 and Value2 are passed directly to the enumerator, the values they are assigned depends on what type of object is being enumerated.
ja: Value1とValue2は列挙者に直接渡されるため、どのような値が割り当てられるかは、列挙されるオブジェクトの種類に依存します。

source: Since AutoHotkey does not have typed parameters, the callback's parameter list is assumed to consist of integers, and some reinterpretation may be required.
ja: AutoHotkeyには型付きパラメータがないため、コールバックのパラメータリストは整数で構成されていると仮定され、いくつかの再解釈が必要となる場合があります。

source: Since AutoHotkey uses UTF-16 natively, WStr (wide character string) is equivalent to Str.
ja: AutoHotkeyはUTF-16をネイティブで使用するため、WStr（ワイド文字列）はStrと同等です。

source: Since NTFS supports mounted volumes and directory junctions, different paths with the same drive letter can produce different amounts of capacity.
ja: NTFSはマウントボリュームとディレクトリジャンクションをサポートしているため、同じドライブレターを持つ異なるパスで異なる容量を生成することができます。

source: Since NTFS supports mounted volumes and directory junctions, different paths with the same drive letter can produce different amounts of free space.
ja: NTFSはマウントボリュームとディレクトリジャンクションをサポートしているため、同じドライブレターで異なるパスを使用すると、異なる量の空き容量が発生します。

source: Since NTFS supports mounted volumes and directory junctions, different paths with the same drive letter can produce different results.
ja: NTFSはマウントボリュームとディレクトリジャンクションをサポートしているため、同じドライブレターで異なるパスを使用すると、異なる結果が得られることがあります。

source: Since SafeArrays are not designed to support multiple references, when one SafeArray is assigned to an element of another SafeArray, a separate copy is created.
ja: SafeArrayは複数参照に対応していないため、あるSafeArrayを別のSafeArrayの要素に割り当てると、別のコピーが作成されます。

source: Since SafeArrays have no reference counting mechanism, if a SafeArray with this flag is assigned to an element of another SafeArray, a separate copy is created.
ja: SafeArrayには参照カウントの仕組みがないため、このフラグを持つSafeArrayが他のSafeArrayの要素に割り当てられると、別のコピーが作成されます。

source: Since SendInput is so fast, it is also more reliable because there is less opportunity for some other window to pop up unexpectedly and intercept the keystrokes.
ja: SendInputは非常に高速なので、他のウィンドウが不意に現れてキー入力を傍受される機会が少なく、信頼性も高いです。

source: Since SendMode also changes the mode of Click and MouseMove/Click/Drag, there may be times when you wish to use a different mode for a particular mouse event.
ja: SendModeはClickやMouseMove/Click/Dragのモードも変更するので、特定のマウスイベントに対して異なるモードを使用したい場合があります。

source: Since a compiled script has merged all its #Include files into one big script, its line numbering may be different than when it is run in non-compiled mode.
ja: コンパイルされたスクリプトは、すべての#Include filesが1つの大きなスクリプトにマージされるため、行番号が非コンパイルモードで実行したときと異なる場合があります。

source: Since a Cdecl function never produces the error described in the next paragraph, it may generate an exception when too few arguments are passed to it.
ja: Cdecl関数は、次の段落で説明するようなエラーを発生させることはないので、引数が少なすぎる場合に例外を発生させることがあります。

source: Since a DWORD is an unsigned 32-bit integer, use "UInt*" or "UIntP" to represent LPDWORD.
ja: DWORDは符号なし32ビット整数なので、LPDWORDを表すには「UInt*」または「UIntP」を使用します。

source: Since a closing parenthesis indicates the end of a continuation section, to have a line start with literal closing parenthesis, precede it with an accent/backtick:
ja: 閉じ括弧は継続セクションの終わりを示すので、リテラルな閉じ括弧で行を開始するには、その前にアクセント記号/バックチックを付ける：

source: Since a closing parenthesis indicates the end of a continuation section, to have a line start with literal closing parenthesis, precede it with an accent/backtick: `).
ja: 閉じ括弧は継続セクションの終わりを示すので、リテラルな閉じ括弧で行を開始するには、その前にアクセント記号/バックチックを付ける：`)。

source: Since a keyboard or mouse remapping is actually a pair of hotkeys, this allows #InputLevel to be used to allow remappings to trigger other hotkeys.
ja: キーボードやマウスのリマッピングは実際には一対のホットキーであるため、#InputLevelを使用してリマッピングが他のホットキーをトリガーできるようにすることができます。

source: Since a name might match multiple running processes, only the first process will be operated upon.
ja: 一つの名前が複数の実行中のプロセスに一致する可能性があるため、最初のプロセスのみが操作されることになります。

source: Since a separate "C" calling convention does not exist in 64-bit code, Cdecl may be specified but has no effect on 64-bit builds of AutoHotkey.
ja: 64ビットコードには個別の「C」呼び出し規約が存在しないため、Cdeclを指定することができますが、AutoHotkeyの64ビットビルドには何の効果もありません。

source: Since all COM interfaces ultimately derive from IUnknown, the first three methods are always QueryInterface (0), AddRef (1) and Release (2).
ja: すべてのCOMインタフェースは最終的にIUnknownから派生するため、最初の3つのメソッドは常にQueryInterface（0）、AddRef（1）、Release（2）です。

source: Since all non-zero numbers are seen as "true", the statement if WinActive(WinTitle) is true whenever WinTitle is active.
ja: 0以外の数値はすべて「true」とみなされるため、if WinActive(WinTitle)というステートメントは、WinTitleがアクティブであればいつでもtrueとなる。

source: Since all non-zero numbers are seen as "true", the statement if WinExist(WinTitle) is true whenever WinTitle exists.
ja: ゼロでない数字はすべて「true」とみなされるため、WinTitleが存在するときはいつでも、if WinExist(WinTitle)というステートメントは真となる。

source: Since an empty string is seen as "false", the function's return value can always be used as a quasi-boolean value.
ja: 空文字列は「false」とみなされるため、この関数の戻り値は常に準ブール値として使用することができる。

source: Since array elements and properties are now separate, enumerating properties requires explicitly creating an enumerator by calling OwnProps.
ja: 配列要素とプロパティが分離されたため、プロパティの列挙にはOwnPropsを呼び出して明示的に列挙者を作成する必要があります。

source: Since calling a function does not start a new thread, any changes made by a function to settings such as SendMode and SetTitleMatchMode will go into effect for its caller too.
ja: 関数を呼び出しても新しいスレッドは始まらないので、関数でSendModeや SetTitleMatchModeなどの設定を変更すると、その呼び出し元にも反映されます。

source: Since comments are filtered out when the script is read from file, they do not impact performance or memory utilization.
ja: コメントはスクリプトをファイルから読み込む際にフィルタリングされるため、パフォーマンスやメモリ使用量に影響を与えることはありません。

source: Since it is legal to include a line like /****/ in v1, but */ at line-end only closes comments in v2, the presence of such a line may cause a large portion of the script to be ignored (by both the launcher and the v1 interpreter).
ja: v1では/****/のような行を含めることは合法だが、v2では行末の*/はコメントを閉じるだけなので、このような行があるとスクリプトの大部分が（ランチャーとv1インタープリターの両方によって）無視される可能性がある。

source: Since it is not known where (or whether) ClassName exists within the chain of base objects, ClassName itself is used as the starting point.
ja: ClassNameがベース・オブジェクトの連鎖のどこに存在するか（あるいは存在するかどうか）は不明なので、ClassName自体が開始点として使用される。

source: Since literal numbers such as 128, 0x7F and 1.0 are converted to pure numbers before the script begins executing, the format of the literal number is lost.
ja: 128、0x7F、1.0などのリテラル数値は、スクリプトの実行開始前に純粋な数値に変換されるため、リテラル数値のフォーマットは失われます。

source: Since nearly all control types start off with word-wrapping enabled, use -Wrap to disable word-wrapping.
ja: ほぼすべての制御タイプは、最初にワードラッピングが有効になっているので、ワードラッピングを無効にするには、-Wrapを使用します。

source: Since negative numbers such as X-10 are reserved for absolute positioning, to use a negative offset, include a plus sign in front of it.
ja: X-10のような負の数は絶対位置決め用に予約されているため、負のオフセットを使用する場合は、その前にプラス記号を含めます。

source: Since negative numbers such as x-10 are reserved for absolute positioning, to use a negative offset, include a plus sign in front of it.
ja: x-10のような負の数は絶対位置決め用に予約されているため、負のオフセットを使用する場合は、その前にプラス記号を含めます。

source: Since only one item at a time can be selected, any previously selected item is automatically de-selected.
ja: 一度に1つの項目しか選択できないため、以前に選択されていた項目は自動的に選択解除される。

source: Since only the object's own properties are enumerated, the property must be defined directly in Obj.
ja: オブジェクト自身のプロパティのみが列挙されるため、プロパティはObjで直接定義する必要があります。

source: Since remappings are translated into hotkeys as described above, the Suspend function affects them.
ja: リマッピングは前述のようにホットキーに変換されるため、サスペンド機能はそれらに影響する。

source: Since some functions may require or return strings in a particular format, the following string types are available:
ja: 関数によっては、特定の形式の文字列を要求したり、返したりすることがあるため、次のような文字列型を用意しています：

source: Since that script offers smooth cursor movement, acceleration, and other features, it is the recommended approach if you plan to do a lot of mousing with the keyboard.
ja: このスクリプトは、スムーズなカーソル移動、加速、その他の機能を提供するので、キーボードでのマウス操作が多い場合は、この方法をお勧めする。

source: Since the #ErrorStdOut directive would have to be added to every script, it is usually better to set up your editor to use the command line switch /ErrorStdOut when launching any AutoHotkey script (see further below for setup instructions).
ja: #ErrorStdOutディレクティブはすべてのスクリプトに追加する必要があるため、通常はAutoHotkeyスクリプトを起動する際にコマンドラインスイッチ /ErrorStdOutを使用するようにエディタを設定する方がよいでしょう（設定方法は以下をご覧ください）。

source: Since the OS frees this memory automatically when the script exits, any script that allocates a small, fixed number of callbacks can get away with not explicitly freeing the memory.
ja: OSはスクリプトの終了時にこのメモリを自動的に解放するので、少量の固定数のコールバックを割り当てるスクリプトであれば、明示的にメモリを解放しなくても大丈夫です。

source: Since the above lacks the Z option, typing 111 (three consecutive 1's) would trigger the hotstring twice because the middle 1 is the last character of the first triggering but also the first character of the second triggering.
ja: 上記にはZオプションがないので、111（3つの連続した1）を入力すると、真ん中の1が最初のトリガーの最後の文字でありながら、2番目のトリガーの最初の文字でもあるため、ホットストリングが2回トリガーされます。

source: Since the buffer is only ever as large as the input string, it was usually not useful for output parameters.
ja: バッファは入力文字列と同じ大きさしかないため、通常、出力パラメータには使えませんでした。

source: Since the control will not expand automatically, use GuiCtrl.Move("w300") if the control needs to be widened.
ja: コントロールは自動的に拡大されないので、コントロールを拡大する必要がある場合は、GuiCtrl.Move("w300")を使用してください。

source: Since the control will not expand automatically, use GuiCtrl.Move(,, 300) if the control needs to be widened.
ja: コントロールは自動的に拡大されないので、コントロールを拡大する必要がある場合は、GuiCtrl.Move(,, 300)を使用してください。

source: Since the control will not expand automatically, use GuiCtrl.Move("w300") or similar if the control needs to be widened.
ja: コントロールは自動的に拡大されないので、拡大したい場合はGuiCtrl.Move("w300")などを使用してください。

source: Since the control will not expand automatically, use GuiCtrl.Move(,, 300) or similar if the control needs to be widened.
ja: コントロールは自動的に拡大されないので、拡大したい場合はGuiCtrl.Move(,, 300)などを使用してください。

source: Since the delimiters are not considered to be part of the substrings themselves, they are never included in the returned array.
ja: 区切り文字は部分文字列の一部とはみなされないので、返される配列に含まれることはない。

source: Since the entries in each group need to be added only once, this function is typically used during script startup.
ja: 各グループのエントリーは一度だけ追加する必要があるため、この機能は通常スクリプトの起動時に使用されます。

source: Since the highest quality setting is usually the default, this feature is more typically used to disable anti-aliasing in specific cases where doing so makes the text clearer.
ja: 通常、最高画質がデフォルトであるため、この機能は、アンチエイリアスを無効にすることで、テキストがより鮮明になる特定のケースで使用されることが一般的です。

source: Since the message box is a built-in feature of the operating system, its X button is enabled only when certain buttons are present.
ja: メッセージボックスはOSの組み込み機能なので、そのXボタンは特定のボタンが存在する場合にのみ有効になります。

source: Since the new ending characters are in effect globally for the entire script -- regardless of where the EndChars directive appears -- there is no need to specify EndChars more than once.
ja: 新しいエンディングキャラクターは、EndCharsディレクティブの出現場所に関係なく、スクリプト全体に対してグローバルに有効であるため、EndCharsを2回以上指定する必要はありません。

source: Since the operating system does not allow simulation of the Ctrl+Alt+Del combination, doing something like Send "^!{Delete}" will have no effect.
ja: オペレーティング システムでは、Ctrl+Alt+Del の組み合わせのシミュレーションはできないので、Send "^!{Delete}" などの操作を行ったとしても、何の影響もありません。。

source: Since the operation will recursively copy a folder along with all its subfolders and files, the result of copying a folder to a destination somewhere inside itself is undefined.
ja: この操作は、フォルダとそのすべてのサブフォルダおよびファイルを再帰的にコピーするため、フォルダをそれ自体の内部のどこかにコピーした場合の結果は未定義です。

source: Since the parameters are evaluated before the function is called, any variable reference becomes permanent at that moment.
ja: パラメータは関数が呼び出される前に評価されるため、変数への参照はその時点で永続的なものとなります。

source: Since the patterns being detected are effectively syntax errors in one version, a script with actual syntax errors or incorrectly mixed syntax might be misidentified.
ja: 検出されるパターンは、実質的に1つのバージョンにおける構文エラーであるため、実際の構文エラーや正しくない構文が混在するスクリプトは、誤認識される可能性がある。

source: Since the process will be abruptly terminated -- possibly interrupting its work at a critical point or resulting in the loss of unsaved data in its windows (if it has any) -- this function should be used only if a process cannot be closed by using WinClose on one of its windows.
ja: プロセスが突然終了するため、重要なポイントで作業が中断されたり、ウィンドウに保存されているデータが失われたりする可能性があるため、この関数は、ウィンドウの1つでWinCloseを使用してプロセスを閉じることができない場合のみ使用する必要があります。

source: Since the search starts at the top row of the region and moves downward, if there is more than one match, the one closest to the top will be found.
ja: 検索は領域の最上段から始まり、下へ下へと移動していくので、複数のマッチングがある場合は、一番上に近いものが検索されることになります。

source: Since the temporary memory used for this conversion is only large enough for the converted input string, any value written to it by the function is discarded.
ja: この変換に使用される一時メモリは、変換された入力文字列分の大きさしかないため、関数によって書き込まれた値は破棄されます。

source: Since the value of such an argument might be modified by the function, whenever a VarRef is passed as the argument, the variable's contents will be updated after the function returns.
ja: このような引数の値は関数によって変更される可能性があるため、引数としてVarRefを渡すと、関数が戻った後にその変数の内容が更新されます。

source: Since the variable is expected to sometimes be uninitialized, no error is thrown in that case.
ja: 変数が初期化されていないことも想定されるので、そのような場合でもエラーは発生しない。

source: Since there may be multiple initializers for a single static variable, compound assignments such as static x += 1 are permitted.
ja: 一つの静的変数に対して複数の初期化子が存在する可能性があるため、static x += 1のような複合代入が許可されます。

source: Since these must match up to GuiCtrl and NotifyCode used to register the callback, they are rarely useful to the script.
ja: これらはコールバックの登録に使用したGuiCtrlとNotifyCodeに一致しなければならないため、ほとんどスクリプトに役立つことはありません。
